apps/backend/api_load_test.yml
config:
  target: "https://booquiz.kro.kr"
  plugins:
    metrics-by-endpoint: {}
  processor: "./function.cjs"
  phases:
    - duration: 3
      arrivalCount: 299
  http:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "HTTP API 테스트"
    flow:
      - function: "generateAndSaveSession"
      - get:
          url: "/api/quiz-zone/loadtest"
          headers:
            Cookie: "connect.sid={{ sessionId }}"
      - think: 1