apps/backend/artillery.test.yml
config:
  target: "http://test.booquiz.kro.kr"
  plugins:
   # ensuer: {}
   # apdex: {}
    metrics-by-endpoint: {}  # 각 API 엔드포인트별 성능 측정
  #ensure:
  #  p95: 200    # 95%의 요청이 200ms 이내 응답
  #  maxErrorRate: 1  # 최대 에러율 1%

  phases:
    - duration: 80
      arrivalRate: 600
  http:
    headers:
      Content-Type: "application/json"
    cookies:
      connect.sid: "s%3AYvwmJO7-YMU4RKd0F1HH223sdNvTsdsd.DvxqWsXW8gHoL6lLVTv6wHv9mgTHBGhHDSROPQPRsdP"
  processor: "./function.cjs"

scenarios:
  - name: "퀴즈 게임 플레이 시나리오"
    flow:
      - function: "setQuizId"
      - capture:
          as: "quizId"
          json: "$.quizZoneId"

      - post:
          url: "/api/quiz-zone"
          json:
            quizZoneId: "{{ quizId }}"

      - get:
          url: "/api/quiz-zone/{{ quizId }}"