apps/backend/ws_load_test.yml
config:
  target: "ws://localhost:3000/play"
  plugins:
    metrics-by-endpoint: {}
  processor: "./function.cjs"
  phases:
    - duration: 3
      arrivalCount: 10

scenarios:
  - name: "WebSocket 테스트"
    engine: "ws"
    flow:
      - function: "getStoredSession"
      - connect:
          headers:
            Cookie: "connect.sid={{ sessionId }}"

      - send:
          type: "join"
          data:
            quizZoneId: "loadtest"