apps/backend/ws_load_test.yml
config:
  target: "wss://booquiz.kro.kr/api/play"
  plugins:
    metrics-by-endpoint: {}
  processor: "./function.cjs"
  phases:
    - duration: 10
      arrivalCount: 299

scenarios:
  - name: "WebSocket 테스트"
    engine: "ws"
    flow:
      - function: "getStoredSession"
      - connect:
          headers:
            Cookie: "connect.sid={{ sessionId }}"
      - send:
          type: "join"
          data:
            quizZoneId: "loadtest"